# SegmentsFittings Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..SegmentsFittings Property
GroupTypeId Class See Also
---
"Segments and Fittings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SegmentsFittings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentsFittings As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SegmentsFittings {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace